cases/closedBox/3D/0.org/M
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      M;
}

dimensions      [-1 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type        sectionalConstant;
        value       $internalField;
    }

    outlet
    {
        type        zeroGradient;
    }

    walls
    {
        type        zeroGradient;
    }

    top
    {
        type        zeroGradient;
    }
}
