cases/closedBox/3D/0.org/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    inlet
    {
        type        epsilonWallFunction;
        value       $internalField;
    }

    outlet
    {
        type        epsilonWallFunction;
        value       $internalField;
    }

    walls
    {
        type        epsilonWallFunction;
        value       $internalField;
    }

    top
    {
        type        epsilonWallFunction;
        value       $internalField;
    }
}
