cases/closedBox/3D/constant/thermophysicalProperties.dispersed
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.dispersed;
}

thermoType
{
    type            heAerosolRhoThermo;
    mixture         aerosolPhase;
    transport       const;
    thermo          hConst;
    energy          sensibleInternalEnergy;
    equationOfState icoPolynomial;
    specie          specie;
}

species
{
    Water
    {
        specie
        {
            molWeight   18.015;
        }
        equationOfState
        {
            rhoCoeffs<8>
            (
               -2.49525800e+02
                1.15364500e+01
               -3.44086500e-02
                3.28071200e-05
                0
                0
                0
                0
            );
        }
        thermodynamics
        {
            Cp          4195;
            Hf          3.331E5;
        }
        transport
        {
            mu          3.645e-4;
            Pr          2.289;
        }
        properties
        {
            sigma       VDI6 (0.15488 1.64129 -0.75986 -0.85291 1.14113 647.096);
        }
    }
}
