cases/closedBox/3D/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel    kEpsilon;

    turbulence  on;

    printCoeffs on;
}
