cases/closedBox/3D/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;

patches
(
    {
        name inlet;

        patchInfo
        {
            type        wall;
        }

        constructFrom set;
        set inlet;
    }
);
