cases/closedBox/3D/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 30;

method             simple;

simpleCoeffs
{
    n              (5 3 2);
    delta          1E-3;
}
