cases/closedBox/3D/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name    inlet;
        type    faceSet;
        action  new;
        source  cylinderToFace;
        p1      (0 0.15990000000000001 0);
        p2      (0 0.1601 0);
        radius  0.01;

        // For the foundation OpenFOAM version:

        sourceInfo
        {
            p1      (0 0.15990000000000001 0);
            p2      (0 0.1601 0);
            radius  0.01;
        }
    }
);
